Repository: hossamadel7/centrny
Catalog: centrny/Resources/OnlineStudent.*.resx
Languages: ar

# Title_Dashboard
source: Student Dashboard
ar: الطالب

# Title_LearningCenter
source: Online lessons
ar: ملف الطالب

# Nav_Dashboard
source: ٍStudent Profile
ar: ملف الطالب

# Nav_LearningCenter
source: Online lessons
ar: الحصص الاونلاين

# Section_AcademicOverview
source: Academic Overview
ar: النظرة الأكاديمية

# Section_StudentInformation
source: Student Information
ar: معلومات الطالب

# Section_EnrolledSubjects
source: Enrolled Subjects
ar: المواد المسجلة

# Section_ExaminationResults
source: Examination Results
ar: نتائج الاختبارات

# Stat_Subjects
source: Subjects
ar: المواد

# Stat_Exams
source: Exams
ar: الاختبارات

# Stat_Attendance
source: Attendance
ar: الحضور

# Stat_Average
source: Average %
ar: المعدل %

# Label_FullName
source: Full Name
ar: الاسم الكامل

# Label_Age
source: Age
ar: العمر

# Label_AgeSuffix
source: years old
ar: سنة

# Label_AcademicYear
source: Academic Year
ar: السنة الدراسية

# Label_Branch
source: Branch
ar: الفرع

# Label_ContactNumber
source: Contact Number
ar: رقم التواصل

# Label_ParentContact
source: Parent Contact
ar: رقم ولي الأمر

# Label_MemberSince
source: Member Since
ar: عضو منذ

# Badge_Subscribed
source: Subscribed
ar: مشترك

# Badge_Regular
source: Regular
ar: عادي

# Empty_NoSubjectsTitle
source: No Subjects
ar: لا توجد مواد

# Empty_NoSubjectsMessage
source: No enrolled subjects yet.
ar: لم يتم تسجيل أي مواد بعد.

# Empty_NoExamsTitle
source: No Exams
ar: لا توجد اختبارات

# Empty_NoExamsMessage
source: No exam results yet.
ar: لا توجد نتائج اختبارات حالياً.

# Empty_NoChaptersTitle
source: No Chapters
ar: لا توجد فصول

# Empty_NoChaptersMessage
source: No chapters available for this subject.
ar: لا توجد فصول متاحة لهذه المادة.

# Empty_NoLessonsTitle
source: No Lessons
ar: لا توجد دروس

# Empty_NoLessonsMessage
source: No lessons available for this chapter.
ar: لا توجد دروس لهذا الفصل.

# Select_SubjectLabel
source: Select Your Subject
ar: اختر المادة

# Select_SubjectPlaceholder
source: Select a subject...
ar: اختر مادة...

# Button_ExploreChapters
source: Explore Chapters
ar: استعراض الفصول

# Header_SubjectChapters
source: Subject Chapters
ar: فصول المادة

# Button_BackToSubjects
source: Back to Subjects
ar: العودة للمواد

# Header_ChapterLessons
source: Chapter Lessons
ar: دروس الفصل

# Button_BackToChapters
source: Back to Chapters
ar: العودة للفصول

# Button_AccessLesson
source: View Lesson
ar: دخول الدرس

# Label_Subject
source: Subject
ar: المادة

# Label_Teacher
source: Teacher
ar: المعلم

# Label_Date
source: Date
ar: التاريخ

# Label_Type
source: Type
ar: النوع

# Label_Status
source: Status
ar: الحالة

# Type_Exam
source: Exam
ar: اختبار

# Type_Quiz
source: Quiz
ar: اختبار قصير

# Status_Passed
source: Passed
ar: ناجح

# Status_Failed
source: Failed
ar: راسب

# Online_Badge
source: Online
ar: أونلاين

# Fee_Label
source: Fee
ar: الرسوم

# Added_Label
source: Added
ar: أضيف

# Alert_DashboardLoaded
source: Dashboard loaded
ar: تم تحميل اللوحة

# Alert_DashboardFailed
source: Failed to load dashboard
ar: فشل تحميل اللوحة

# Alert_LoadChaptersFailed
source: Failed to load chapters
ar: فشل تحميل الفصول

# Alert_LoadLessonsFailed
source: Failed to load lessons
ar: فشل تحميل الدروس

# Alert_LoadSubjectsFailed
source: Failed to load subjects
ar: فشل تحميل المواد

# Alert_LoadExamsFailed
source: Failed to load exams
ar: فشل تحميل الاختبارات

source: Loading subjects...
ar: جارٍ تحميل المواد...

# Loading_Exams
source: Loading examination results...
ar: جارٍ تحميل نتائج الاختبارات...

source: Loading chapters...
ar: جارٍ تحميل الفصول...

source: Loading lessons...
ar: جارٍ تحميل الدروس...

# Confirm_AccessLesson
source: Access this lesson?
ar: هل تريد الدخول إلى هذا الدرس؟

source: Redirecting...
ar: جارٍ إعادة التوجيه...

source: Not Assigned
ar: غير محدد

source: Not Provided
ar: غير متوفر

source: Error
ar: خطأ

# Title_Homework
source: Homework
ar: الواجبات

# Nav_Homework
source: Homework
ar: الواجبات

source: Assignments
ar: الواجبات

source: Available Videos
ar: فيديوهات متاحة

source: Downloadable Files
ar: ملفات قابلة للتحميل

source: Loading homework...
ar: جارٍ تحميل الواجبات...

source: Loading assignments...
ar: جارٍ تحميل الواجبات...

source: Loading videos...
ar: جارٍ تحميل الفيديوهات...

# Loading_Downloads
source: Loading files...
ar: جارٍ تحميل الملفات...

source: No Assignments
ar: لا توجد واجبات

# NoAssignmentsMsg
source: No assignments available for your latest lesson in this subject.
ar: لا توجد واجبات متاحة لآخر درس في هذه المادة.

source: No Videos
ar: لا توجد فيديوهات

# NoVideosMsg
source: No videos available for your latest lesson in this subject.
ar: لا توجد فيديوهات متاحة لآخر درس في هذه المادة.

source: No Files
ar: لا توجد ملفات

# NoFilesMsg
source: No downloadable files available for your latest lesson in this subject.
ar: لا توجد ملفات قابلة للتحميل لآخر درس في هذه المادة.

source: Attend Assignment
ar: حضور الواجب

source: Attended
ar: تم الحضور

source: Watch Video
ar: مشاهدة الفيديو

source: Download
ar: تنزيل

# Failed_Load_Assignments
source: Failed to load assignments.
ar: فشل تحميل الواجبات.

# Failed_Load_Videos
source: Failed to load videos.
ar: فشل تحميل الفيديوهات.

# Failed_Load_Downloads
source: Failed to load downloadable files.
ar: فشل تحميل الملفات القابلة للتحميل.

source: Closed.
ar: مغلق.

# Access_Expired
source: Access expired. Enter PIN.
ar: انتهى الوصول. أدخل رمز PIN.

# Section_AttendedSessions
source: Attended Sessions
ar: الجلسات التي تم حضورها

source: Loading sessions...
ar: جارٍ تحميل الجلسات...

# Empty_NoSessionsTitle
source: No Attended Sessions
ar: لا توجد جلسات

# Empty_NoSessionsMessage
source: No attendance records yet.
ar: لا توجد سجلات حضور حتى الآن.

# Alert_LoadSessionsFailed
source: Failed to load sessions
ar: فشل تحميل الجلسات

# Source_Online
source: Online
ar: أونلاين

# Source_Center
source: Center
ar: السنتر

# Label_Language
source: Language
ar: اللغة

source: Logout
ar: تسجيل الخروج
