Repository: hossamadel7/centrny
Catalog: centrny/Resources/Student.*.resx
Languages: ar

source: Student Profile
ar: ملف الطالب

source: Academic Year
ar: السنة الدراسية

source: Branch
ar: الفرع

source: Student
ar: طالب

source: Active Student
ar: طالب نشط

source: Inactive Student
ar: طالب غير نشط

source: Parent Phone
ar: هاتف ولي الأمر

source: Student Phone
ar: هاتف الطالب

source: Upcoming Exams
ar: الامتحانات القادمة

source: Loading upcoming exams...
ar: جاري تحميل الامتحانات القادمة...

source: Attended Exams
ar: الامتحانات التي تم حضورها

source: Loading attended exams...
ar: جاري تحميل الامتحانات المُحضرة...

source: Assignments
ar: الواجبات

source: Loading assignments...
ar: جاري تحميل الواجبات...

source: Today's Classes
ar: حصص اليوم

source: Admin View
ar: عرض الإدارة

# ViewingTodaysClassesOnlyAdmins
source: Viewing today's classes. Only administrators can mark attendance.
ar: عرض حصص اليوم. فقط المسؤولون يمكنهم تسجيل الحضور.

source: Loading today's classes...
ar: جاري تحميل حصص اليوم...

source: Enrolled Subjects
ar: المواد المسجلة

source: Search subjects...
ar: ابحث في المواد...

source: Loading subjects...
ar: جاري تحميل المواد...

source: Weekly Classes
ar: حصص الأسبوع

source: No Upcoming Exams
ar: لا توجد امتحانات قادمة

# NoUpcomingExamsMsg
source: No upcoming exams for this student at the moment.
ar: لا توجد امتحانات قادمة لهذا الطالب حاليا.

source: No Assignments
ar: لا توجد واجبات

# NoAssignmentsMsg
source: No assignments for this student at the moment.
ar: لا توجد واجبات لهذا الطالب حاليا.

source: No Attended Exams
ar: لا توجد امتحانات تم حضورها

# NoAttendedExamsMsg
source: This student has not attended any exams yet.
ar: لم يحضر هذا الطالب أي امتحانات بعد.

source: No Subjects Found
ar: لا توجد مواد

# NoSubjectsFoundMsg
source: This student is not enrolled in any subjects yet.
ar: هذا الطالب غير مسجل في أي مواد بعد.

source: No Classes Available
ar: لا توجد حصص متاحة

# NoClassesAvailableMsg
source: There are no classes available for attendance right now.
ar: لا توجد حصص متاحة للحضور حاليا.

source: No Classes This Week
ar: لا توجد حصص هذا الأسبوع

# NoClassesThisWeekMsg
source: There are no classes scheduled for this week.
ar: لا توجد حصص مجدولة لهذا الأسبوع.

source: Loading weekly classes...
ar: جاري تحميل حصص الأسبوع...

source: Error
ar: خطأ

source: Failed to load exams.
ar: فشل في تحميل الامتحانات.

source: Failed to load assignments.
ar: فشل في تحميل الواجبات.

source: Failed to load subjects.
ar: فشل في تحميل المواد.

# FailedToLoadClasses
source: Failed to load upcoming classes.
ar: فشل في تحميل الحصص القادمة.

source: Attended
ar: تم الحضور

source: Already Attended
ar: تم الحضور بالفعل

source: Attend Assignment
ar: حضور الواجب

source: Attend Exam
ar: حضور الامتحان

source: Mark Attendance
ar: تسجيل الحضور

source: Not available for attendance
ar: غير متاح للتسجيل الآن

# OnlyAdminsAttendance
source: Only administrators can mark attendance
ar: فقط المسؤولون يمكنهم تسجيل الحضور

source: Attendance marked successfully!
ar: تم تسجيل الحضور بنجاح!

source: Failed to mark attendance.
ar: فشل في تسجيل الحضور.

# AttendanceError
source: An error occurred while marking attendance.
ar: حدث خطأ أثناء تسجيل الحضور.

source: Marking...
ar: جاري التسجيل...

source: Start Time
ar: وقت البداية

source: End Time
ar: وقت النهاية

source: Free
ar: مجاني

source: Online
ar: أونلاين

source: In-Person
ar: حضوري

source: Degree
ar: الدرجة

source: N/A
ar: غير متوفر

# ViewAssignmentsAndExams
source: View your assignments and exams
ar: عرض الواجبات والامتحانات الخاصة بك

# Btn_OK
source: OK
ar: موافق
